In [1]:
import pandas as pd;

In [2]:
data = {
    'name':['vishal', 'om', 'Shubz'],
    'age' : [22,12,33]
}

df = pd.DataFrame(data)

In [3]:
df

     name  age
0  vishal   22
1      om   12
2   Shubz   33

In [4]:
df['DOJ'] = ['2002-12-22', '2003-2-23', '2023-11-11']

In [5]:
df

     name  age         DOJ
0  vishal   22  2002-12-22
1      om   12   2003-2-23
2   Shubz   33  2023-11-11

In [6]:
df['DOJ'].dtype

dtype('O')

In [7]:
df['DOJ'] = pd.to_datetime(df['DOJ'])

In [8]:
df['DOJ'].dtype

dtype('<M8[ns]')

In [9]:
df

     name  age        DOJ
0  vishal   22 2002-12-22
1      om   12 2003-02-23
2   Shubz   33 2023-11-11

In [14]:
data = df.drop('DOJ', axis=1)
data

     name  age
0  vishal   22
1      om   12
2   Shubz   33

In [15]:
data

     name  age
0  vishal   22
1      om   12
2   Shubz   33

In [16]:
data['Doj'] = ['01-12-2002', '23-04-2004', '11-11-2005']

In [17]:
data

     name  age         Doj
0  vishal   22  01-12-2002
1      om   12  23-04-2004
2   Shubz   33  11-11-2005

In [18]:
data['Doj'].dtype

dtype('O')

In [22]:
data['Doj'] = pd.to_datetime(data['Doj'], format = '%d-%m-%Y')

In [23]:
data

     name  age        Doj
0  vishal   22 2002-12-01
1      om   12 2004-04-23
2   Shubz   33 2005-11-11

In [25]:
data['Doj'].dtype

dtype('<M8[ns]')

In [26]:
data

     name  age        Doj
0  vishal   22 2002-12-01
1      om   12 2004-04-23
2   Shubz   33 2005-11-11

In [31]:
data['Doj'].dt.year
data['Doj'].dt.month
data['Doj'].dt.day
data['Doj'].dt.day_name()

0    Sunday
1    Friday
2    Friday
Name: Doj, dtype: object